{
  "basics": {
    "name": "Vicente Opaso",
    "label": "Web Engineering Manager & Frontend Architect<br/>Expert in Composable Platforms, Design Systems & Developer Experience<br/>25+ Years Delivering High-Impact Digital Solutions",
    "removed": {
      "email": "vicente@opa.so",
      "phone": "+34 684 005 262",
      "website": "https://opa.so",
      "location": {
        "city": "Benalmádena, Málaga",
        "countryCode": "Spain"
      },
      "profiles": [
        {
          "network": "X | Twitter",
          "username": "vicenteopaso",
          "url": "https://x.com/vicenteopaso"
        },
        {
          "network": "LinkedIn",
          "username": "vicenteopaso",
          "url": "https://linkedin.com/in/vicenteopaso"
        },
        {
          "network": "GitHub",
          "username": "vicenteopaso",
          "url": "https://github.com/vicenteopaso"
        }
      ]
    },
    "summary": "I’m a Web Engineering Manager and Frontend Architect with 25+ years designing, scaling, and maintaining high-performance digital platforms across enterprise, e-commerce, and mission-critical environments. I specialize in composable architecture, Design Systems, and Developer Experience (DevEx)—aligning technology, design, and strategy to deliver accessible, performant, and maintainable products.<br/><br/>I lead cross-functional teams, modernize CI/CD and code governance, and foster strong engineering culture through mentorship and Communities of Practice. My approach blends technical architecture with design empathy and operational discipline to unlock durable, business-aligned outcomes.",
    "highlights": [
      "<b>Web Engineering Manager @ Nexthink</b><br/>Own the architecture and delivery of <i>nexthink.com</i>—a global composable marketing platform—while leading a cross-functional team focused on performance, accessibility, localization, and strategic alignment.<br/><br/>",
      "<b>Technical Application Owner @ EUROCONTROL</b><br/>Lead frontend governance and modernization for aviation platforms (NMUI, EDS), aligning safety, compliance, and delivery at scale.<br/><br/>",
      "<b>Design System Architect (EDS & Malty)</b><br/>Drive UI consistency, accessibility, and reuse with enterprise-grade component libraries and contribution models.<br/><br/>",
      "<b>Solutions Architect</b><br/>For enterprise B2B platforms at Carlsberg Group (≥ €1B annual turnover) and global marketing frameworks.<br/><br/>",
      "<b>CoP Builder</b><br/>Found and scale Communities of Practice to raise standards, share knowledge, and improve DevEx.<br/><br/>",
      "<b>Agile Leader</b><br/>Guide cross-functional teams with iterative delivery, documentation, and measurable outcomes.<br/><br/>",
      "<b>Digital Agency Co-founder</b><br/>Delivered full-stack web and mobile solutions for Fortune 500 and public sector clients."
    ]
  },
  "work": [
    {
      "company": "Nexthink | Hybrid"
    },
    {
      "position": "Manager of Web Engineering",
      "startDate": "2025-07",
      "endDate": ""
    },
    {
      "summary": "Lead the team behind <i>nexthink.com</i>—Nexthink’s global, composable web platform supporting brand, marketing, and product strategy. Focus on team structure, DevEx, and design–engineering collaboration to deliver reliable, scalable, and localized experiences.",
      "highlights": [
        "Own architecture and delivery of a composable stack: Next.js, GraphQL, Tailwind CSS, Hygraph CMS—deployed on Vercel and tightly integrated with GitHub.",
        "Implement guardrails and governance: CodeQL, Copilot, branch protections, PR templates, and automated checks to raise code quality and reliability.",
        "Integrate Vercel–GitHub–Hygraph workflows for faster, safer releases; standardize pipelines with GitHub Actions (CI/CD).",
        "Manage a cross-functional team (3 developers, 1 UX designer) focused on performance, accessibility, maintainability, and content velocity.",
        "Improve design ↔ development feedback loops with shared components, design tokens, and documentation for tighter iteration.",
        "Coordinate localization and campaign delivery across six languages with brand, content, and demand-gen stakeholders."
      ],
      "skills": [
        "Frontend Architecture",
        "Composable Web Platforms",
        "Developer Experience",
        "CI/CD Automation",
        "Web Performance Optimization",
        "Team Leadership",
        "Next.js",
        "GraphQL",
        "Tailwind CSS",
        "Hygraph CMS",
        "Vercel",
        "CodeQL",
        "GitHub Actions"
      ]
    },
    {
      "company": "EUROCONTROL | Brussels, Belgium (Onsite)"
    },
    {
      "position": "Technical Application Owner (User Domain)",
      "summary": "Own Frontend Architecture, governance, and compliance for user-facing frameworks supporting the Network Manager Operations Centre (NMOC). Bridge engineering, product, and regulatory stakeholders in a safety-critical environment.",
      "startDate": "2025-02",
      "endDate": "2025-07"
    },
    {
      "summary": "Key Highlights:",
      "highlights": [
        "Maintain the Formal Thread of documentation to meet safety, regulatory, and engineering standards across components.",
        "Provide technical leadership for NMUI (microfrontend framework) enabling multitasking and interoperability across mission-critical apps.",
        "Guide the strategy and implementation of the EUROCONTROL Design System (EDS) for accessible, consistent UI/UX.",
        "Secondment leading DevEx improvements: CI/CD modernization, automation, onboarding, and access management to streamline delivery.",
        "Act as technical liaison aligning architecture with operational readiness and compliance requirements.",
        "Established improved documentation workflows and foundations for sustainable developer experience across teams."
      ],
      "skills": [
        "Software Architecture",
        "Technical Governance",
        "Design Systems",
        "Solution Architecture",
        "Information Architecture",
        "Engineering Leadership",
        "Agile Leadership",
        "Documentation",
        "Front End Engineering Design (FEED)",
        "Microfrontends"
      ]
    },
    {
      "company": "Carlsberg Group | Lisbon, Portugal (Hybrid)"
    },
    {
      "position": "Frontend Solutions Architect",
      "summary": "Led the design and delivery of scalable Frontend Architectures for global B2B and marketing platforms, aligning engineering with commercial priorities and DevEx maturity.",
      "startDate": "2022-12",
      "endDate": "2024-12",
      "highlights": [
        "Architected web platforms supporting €1B+ annual turnover across regions; improved performance, reliability, and accessibility.",
        "Modernized CI/CD with GitHub Actions and feature toggles to reduce deployment friction and improve release cadence.",
        "Defined documentation and onboarding workflows to increase transparency and consistency across distributed teams.",
        "Partnered with design and marketing to align UX, compliance, and performance with brand and growth goals.",
        "Member of Software Engineering Leadership Team, shaping standards and governance."
      ]
    },
    {
      "summary": "Overseeing:",
      "highlights": [
        "Two B2B e-commerce platforms with €1B+ yearly turnover",
        "Malty Design System monorepo (TypeScript, React) and documentation",
        "Lean Sign-up customer acquisition platform"
      ]
    },
    {
      "summary": "Launched key initiatives:",
      "highlights": [
        "Founded the first Frontend Community of Practice (CoP)",
        "Improved Developer Experience via automation and AI-assisted workflows",
        "Streamlined Agile practices and simplified CI/CD for frictionless releases",
        "Introduced feature toggles to minimize release risk",
        "Standardized documentation for knowledge sharing"
      ]
    },
    {
      "position": "Solutions Architect – Digital Marketing & Consumer Tech",
      "summary": "Architected and delivered global marketing solutions (Cookie Consent, Age Gateway, Global Policies) using TypeScript/React and headless CMS (primarily Umbraco), balancing compliance, localization (i18n), and performance.",
      "startDate": "2022-12",
      "endDate": "2024-07"
    },
    {
      "summary": "Key Highlights:",
      "highlights": [
        "Implemented privacy/compliance frameworks deployed across markets (Cookie Consent, Age Gateway, Global Policy).",
        "Built analytics integrations to improve data-driven decision making.",
        "Aligned technology with brand and growth strategies across marketing, data, and product.",
        "Delivered modular, secure architectures enabling multi-market scalability."
      ]
    },
    {
      "position": "Lead Developer & Architect – Malty Design System",
      "summary": "Led the architecture, development, and adoption of Malty—an enterprise React/TypeScript Design System built with an inner-sourcing model. Scaled contribution, governance, and documentation to enable reuse across products.",
      "startDate": "2021-01",
      "endDate": "2022-12"
    },
    {
      "summary": "Selected achievements:",
      "highlights": [
        "Established governance, versioning, and contribution guidelines; integrated Figma + Storybook + CI/CD.",
        "Standardized components and accessibility (WCAG 2.1) across B2B and consumer products.",
        "Drove adoption across global teams with onboarding materials and documentation."
      ]
    },
    {
      "position": "Principal Frontend Developer",
      "summary": "Owned delivery for key web apps across Carlsberg’s ecosystem, co-managing CarlShop+ (B2B, €1B+ revenue) and leading frontend for CADI (in-house CRM), while mentoring developers and improving delivery practices.",
      "startDate": "2021-03",
      "endDate": "2022-12"
    },
    {
      "summary": "Selected achievements:",
      "highlights": [
        "Co-managed the architecture and delivery of CarlShop+ (B2B, €1B+ revenue).",
        "Led frontend for CADI CRM; ensured performance, data integrity, and security compliance.",
        "Advanced Malty Design System and Lean Sign-up to streamline onboarding and UI consistency."
      ]
    },
    {
      "position": "Lead Frontend Developer",
      "summary": "Joined Carlsberg’s Digital Team (remote) to co-create an internal Single-SPA microfrontend platform with TypeScript/React on AWS, and to establish CI/CD automation via GitHub Actions.",
      "startDate": "2020-01",
      "endDate": "2021-03"
    },
    {
      "summary": "Selected achievements:",
      "highlights": [
        "Co-created internal back-office Single-SPA platform with reusable boilerplates.",
        "Implemented automated CI/CD pipelines with GitHub Actions.",
        "Kickstarted documentation for existing apps and platform standards."
      ]
    },
    {
      "company": "Greygoo | Chicago, Illinois (Onsite)",
      "position": "Co-founder and Principal",
      "startDate": "2012-03",
      "endDate": "2019-06",
      "summary": "Co-founded a digital studio delivering high-performance web and mobile applications for enterprise and public sector clients. Directed architecture, product strategy, and full-cycle delivery."
    },
    {
      "summary": "Selected achievements:",
      "highlights": [
        "Partnered with GO GROUND (NCAA) to deliver three web and two mobile applications for event operations.",
        "Secured a $200K+ engagement with eventSpring; led technical direction and delivery.",
        "Delivered cross-platform apps with React Native, Ionic, and custom frameworks for clients including General Motors, Paulson Institute, and Naperville Park District."
      ]
    },
    {
      "company": "Opaso LLC — Self-employed | Chicago, Illinois (Remote)"
    },
    {
      "position": "Senior Frontend Developer",
      "summary": "Contracted by Prizm Tech Group to lead Frontend Architecture and delivery of a white-label Home Healthcare Management platform; combined technical leadership with client and team coordination.",
      "startDate": "2018-12",
      "endDate": "2019-06"
    },
    {
      "summary": "Selected achievements:",
      "highlights": [
        "Led a distributed team from UX and data modeling to UI implementation and delivery.",
        "Managed client relations and sprint execution for on-time deployments.",
        "Designed a scalable Angular/TypeScript architecture with reusable components and documentation."
      ]
    },
    {
      "company": "Cro Metrics | Chicago, Illinois (Remote)"
    },
    {
      "position": "A/B Testing Developer",
      "summary": "Built and ran front-end experiments for CRO programs, collaborating with product/design/analytics to improve engagement and conversion.",
      "startDate": "2018-06",
      "endDate": "2018-11"
    },
    {
      "summary": "Selected achievements:",
      "highlights": [
        "Developed lightweight, high-performance test variants to improve conversion and UX.",
        "Documented learnings and decisions via JIRA, Trello, and Quip for process transparency."
      ]
    },
    {
      "company": "Upshot | Chicago, Illinois (Onsite)"
    },
    {
      "position": "Freelance Web Developer",
      "summary": "Delivered frontend for high-priority agency initiatives under tight timelines, collaborating with designers and strategists to meet brand and performance standards.",
      "startDate": "2011-04",
      "endDate": "2012-04",
      "highlights": [
        "Led frontend for a six-month internal platform at Hilton Hotels (content creation & management).",
        "Built responsive, accessible microsites and web apps for clients including Anheuser-Busch and Omron."
      ]
    },
    {
      "company": "Nokia Networks | United States (Traveling)"
    },
    {
      "position": "Contracting Engineer",
      "summary": "Managed nationwide telecommunications deployments, directing engineering teams and vendors to deliver high-quality rollouts and maintain client relationships.",
      "startDate": "2001-10",
      "endDate": "2011-03"
    },
    {
      "summary": "Selected achievements:",
      "highlights": [
        "Delivered large-scale rollouts for AT&T, T-Mobile, and Alascom (AT&T Alaska).",
        "Led a $10M T-Mobile program establishing UMTS (4G) capability; managed 20+ field crews and RF teams across multi-state surveys."
      ]
    }
  ],
  "education": [
    {
      "institution": "Universidad del Pacífico",
      "area": "Graphic Design",
      "studyType": "Bachelor",
      "startDate": "1998-03",
      "endDate": "1998-12"
    }
  ],
  "skills": [
    {
      "name": "JavaScript",
      "level": "Master",
      "keywords": ["TypeScript", "Node.js", "ECMAScript", "Micro Frontends"]
    },
    {
      "name": "Frontend Development",
      "level": "Master",
      "keywords": [
        "React",
        "Next.js",
        "Angular",
        "React Native",
        "Gatsby",
        "Progressive Web Apps",
        "SPA",
        "Server-Side Rendering",
        "Static Site Generation",
        "Headless CMS",
        "GraphQL",
        "REST",
        "Service Workers"
      ]
    },
    {
      "name": "Design Systems",
      "level": "Master",
      "keywords": ["Figma", "Storybook", "Design Tokens", "Inner-sourcing", "Governance"]
    },
    {
      "name": "Developer Experience",
      "level": "Master",
      "keywords": ["CI/CD Optimization", "GitHub Actions", "CodeQL", "Onboarding Automation", "Tooling Workflows", "DX Strategy"]
    },
    {
      "name": "AWS",
      "level": "Advanced",
      "keywords": ["S3", "CloudFront", "Lambda", "CloudWatch", "Amplify"]
    },
    {
      "name": "GitHub",
      "level": "Advanced",
      "keywords": ["GitHub Actions", "Pages", "Packages", "GHAS", "Branch Protections"]
    },
    {
      "name": "HTML",
      "level": "Master",
      "keywords": ["HTML5", "Web Components", "HTML Modules", "Canvas", "Semantic HTML"]
    },
    {
      "name": "CSS",
      "level": "Master",
      "keywords": ["Tailwind CSS", "Sass", "Less", "CSS-in-JS"]
    },
    {
      "name": "Testing",
      "level": "Basic",
      "keywords": ["Jest", "Cypress", "React Testing Library"]
    }
  ],
  "languages": [
    {
      "language": "Spanish",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Bilingual Proficiency (C2)"
    }
  ],
  "interests": [
    {
      "name": "Saltwater Aquariums",
      "keywords": ["Coral", "Reef", "Marine", "Invertebrates", "Fishkeeping", "Clownfish"]
    },
    {
      "name": "DIY IoT Maker",
      "keywords": ["Raspberry Pi", "Arduino", "Magic Mirror", "OpenHAB", "Home Automation", "Homebridge"]
    },
    {
      "name": "Crypto",
      "keywords": ["Bitcoin", "Ethereum", "NFT", "BCube", "Web3"]
    }
  ],
  "references": [
    {
      "name": "<a href='https://www.linkedin.com/in/peterbirkholmbuch'>Peter Birkholm-Buch</a> | Director of Software Engineering in Growth Products & Data @ Carlsberg Group",
      "reference": "<p>It has been a privilege to have Vicente as part of my Leadership Team at Carlsberg Group. As our Frontend Solutions Architect, Vicente played a critical role in shaping our frontend strategy, notably through the development of the Malty Design System, which has transformed how we approach global frontend solutions.<p/><p>His technical expertise in JavaScript, TypeScript, React, and Frontend technologies, combined with his leadership in establishing a Community of Practice, has greatly improved the developer experience and code quality across the organization. Vicente's contributions were instrumental in driving our e-commerce growth to over €1 billion annually.<p/><p>I highly recommend Vicente for his leadership, creativity, and exceptional technical skills. He would be a tremendous asset to any team.</p>"
    },
    {
      "name": "<a href='https://www.linkedin.com/in/razvan-mihai-margauan'>Razvan Margauan</a> | iNM Programme Director @ EUROCONTROL",
      "reference": "<p>I had the chance to work closely with Vicente Opaso during my time leading the USER Domain at EUROCONTROL. Vicente played a key role in shaping the technical direction of both the NMUI framework and the Eurocontrol Design System (EDS), two major initiatives that supported our operational platforms.<p/><p>He approached his responsibilities with clarity and consistency - whether it was aligning architectural work with regulatory requirements or improving developer workflows across teams. I particularly appreciated Vicente's ability to foster cross-functional collaboration, which made him a reliable contributor.<p/><p>His work had a noticeable impact on the stability and scalability of our systems, and I appreciated his pragmatic, steady approach to solving technical challenges.</p>"
    },
    {
      "name": "<a href='https://www.linkedin.com/in/samuel-silva-olv'>Samuel Silva</a> | Senior Frontend Developer @ Carlsberg Group",
      "reference": "<p>Working alongside Vicente on various projects over the past two years has been an absolute pleasure. As a Solutions Architect, he consistently shows dedication in delivering excellent solutions that meet our business needs while valuing the team's expertise every step of the way.<p/><p>Besides his technical skills, Vicente is a team player who creates a positive and collaborative work environment. He consistently goes above and beyond to support colleagues and shares his expertise within our company's internal community.<p/><p>I highly recommend Vicente for any project in need of a talented and dedicated Solutions Architect. He brings abundant expertise, professionalism, and enthusiasm to every project.<p/>"
    },
    {
      "name": "<a href='https://www.linkedin.com/in/tmota-design'>Thiago Mota</a> | Senior Product Designer @ Carlsberg Group",
      "reference": "<p>Collaborating with Vicente Opaso, the Solutions Architect and Lead Developer for the Malty Design System at Carlsberg Group, was a testament to his extensive expertise and professionalism. Vicente brought a wealth of knowledge to our work on the Malty Design System. His deep expertise and unwavering professionalism were evident throughout our collaboration. Vicente's collaborative approach and ability to align technical intricacies with design aspirations made a significant impact, ensuring the scalability and success of the project. His commitment to excellence and adeptness in fostering collaboration make him a valuable asset in delivering robust solutions.<p/>"
    },
    {
      "name": "<a href='https://www.linkedin.com/in/brunomptorres'>Bruno Torres</a> | Senior Frontend Developer @ Carlsberg Group",
      "reference": "<p>It's with genuine pleasure that I share my admiration for Vicente, the incredibly talented Frontend Solutions Architect I had the chance to work with at Carlsberg. Working alongside him has been more than just a professional experience; it's been a journey of growth and camaraderie.<p/><p>Vicente stands out for his technical prowess and his genuine commitment to building a tight-knit Frontend Community. Under his guidance, I've felt a sense of trust and support beyond the usual workplace dynamic. Vicente's efforts to create a collaborative environment have made our team feel like a family, fostering an atmosphere where everyone's contributions are valued.<p/><p>As a Frontend Developer, I've greatly appreciated Vicente's approach to problem-solving and his emphasis on sharing knowledge. His mentorship has elevated my technical skills and made our workplace a positive and uplifting space.<p/><p>I wholeheartedly recommend Vicente Opaso to anyone looking for more than just a leader – someone who values humanity and teamwork as much as technical excellence.<p/>"
    }
  ],
  "publications": [
    {
      "name": "Empowering Design Systems: How Communities of Practice Drive Innovation and Scalability",
      "publisher": "LinkedIn",
      "releaseDate": "2024-10-02",
      "url": "https://www.linkedin.com/pulse/empowering-design-systems-how-communities-practice-drive-opaso-j0icf/"
    },
    {
      "name": "Driving Innovation from the Ground Up: The Power of Communities of Practice",
      "publisher": "LinkedIn",
      "releaseDate": "2024-09-30",
      "url": "https://www.linkedin.com/pulse/driving-innovation-from-ground-up-power-communities-practice-opaso-3msef/"
    }
  ]
}
